Tekla Open API Reference for Tekla Structures 2025
SpiralBeam Constructor
Overload List
Name | Description
SpiralBeam()
 Initializes a new instance of the SpiralBeam class.
SpiralBeam(Point, Point, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters. Rotation axis direction is current positive Z direction.
SpiralBeam(Point, Point, Point, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters.
SpiralBeam(Point, Point, Point, Double, Double, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters.
Top
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace